package days03;

public class Ex04 {

	public static void main(String[] args) {
		
		//[예] 9.123456 실수 -> 2진수 실수 변환 -> float(4)/double(8)
		//	1001.00011111100110101101101111100110101101101111001101011011011110011010110110111100110101101101...
		// 부동소수점
		//		가수(M)
		//	1.00011111100110101101101111100110101101101111001101011011011110011010110110111100110101101101...
		//	X 2^3(지수 E)
		
		
		
		// int(4)
		
		// float(4)
		
		// double(8)
		
		
		//오차가 없는 실수를 사용하려면 BigDecimal 클래스를 사용해야함
		char c = '\u0041';
		System.out.printf("%c",c);
				
		
		
	} //main
	
} //class
